app/Controllers/Mahasiswa.php

            ];
            return $this->response->setJSON($data);
        }
        $return = $this->mahasiswaModel->save([
            'email' => $this->request->getVar('email'),
            'nim' => $this->request->getVar('nim'),
            'fullname' => $this->request->getVar('fullname'),
            'user_image' => $this->request->getVar('userImage'),
        ]);
---
INSERT INTO `mahasiswa` (`email`, `nim`, `fullname`, `user_image`) VALUES ('asepdadang@gmail.com', '2002', 'asepdadang', 'mamang.jpg')

    public function remove($id_mahasiswa = null)
    {
        $count = $this->builder->where('id', $id_mahasiswa)->countAllResults();
        if ($count == 0) {
            $this->response->setStatusCode(404);
            $data = [
                'statusCode' => 404,
                'status' => 'failed',
                'message' => "Data mahasiswa dengan id $id_mahasiswa tidak ditemukan"
            ];
            return $this->response->setJSON($data, 404);
        } else {
            $this->builder->delete(['id' => $id_mahasiswa]);
---
DELETE FROM `mahasiswa`
WHERE `id` = '11'