app/Models/MahasiswaModel.php

    public function getMahasiswa($id_mahasiswa = false)
    {
        if ($id_mahasiswa == false) {
            return $this->findAll();
        }
        return $this->where(['id' => $id_mahasiswa])->first();
---
SELECT *
FROM `mahasiswa`
SELECT *
FROM `mahasiswa`
WHERE `id` = '2'
 LIMIT 1